Repository: omardoucoure/afriquesports-web
Catalog: wordpress-plugins/afrique-sports-seo-checker/languages/afrique-sports-seo-*.po
Languages: fr_fr

source: SEO Checklist - Afrique Sports
fr_fr: Liste de contrôle SEO - Afrique Sports

source: All items must pass before publishing. Click "Run Check" to validate.
fr_fr: Tous les éléments doivent être validés avant publication. Cliquez sur "Vérifier" pour valider.

source: Run Check
fr_fr: Vérifier

source: Enable
fr_fr: Activer

source: Save Settings
fr_fr: Enregistrer les paramètres

source: Last checked: %s
fr_fr: Dernière vérification : %s

source: ago
fr_fr: il y a

source: Checking...
fr_fr: Vérification en cours...

source: Passed
fr_fr: Validé

source: Failed
fr_fr: Échoué

source: Warning
fr_fr: Avertissement

source: Publishing Blocked: SEO Requirements Not Met
fr_fr: Publication bloquée : Exigences SEO non satisfaites

source: Your post does not meet the required SEO standards. Please check the SEO Checklist meta box below the editor and fix all required items before publishing.
fr_fr: Votre article ne répond pas aux normes SEO requises. Veuillez consulter la liste de contrôle SEO sous l'éditeur et corriger tous les éléments requis avant de publier.

source: %d Passed
fr_fr: %d Validés

source: %d Failed
fr_fr: %d Échoués

source: %d Warnings
fr_fr: %d Avertissements

source: Publishing blocked: %d required items must pass.
fr_fr: Publication bloquée : %d éléments requis doivent être validés.

source: Title Length
fr_fr: Longueur du titre

source: Title should be between %d and %d characters for optimal SEO and display in search results.
fr_fr: Le titre doit contenir entre %d et %d caractères pour un SEO optimal et un bon affichage dans les résultats de recherche.

source: Title is too short (%d characters). Minimum: %d characters.
fr_fr: Le titre est trop court (%d caractères). Minimum : %d caractères.

source: Title is too long (%d characters). Maximum: %d characters.
fr_fr: Le titre est trop long (%d caractères). Maximum : %d caractères.

source: Title length is perfect (%d characters).
fr_fr: La longueur du titre est parfaite (%d caractères).

source: Word Count
fr_fr: Nombre de mots

source: Content should contain between %d and %d words for optimal article length.
fr_fr: Le contenu doit contenir entre %d et %d mots pour une longueur d'article optimale.

source: Content is too short (%d words). Minimum: %d words.
fr_fr: Le contenu est trop court (%d mots). Minimum : %d mots.

source: Content is too long (%d words). Maximum: %d words.
fr_fr: Le contenu est trop long (%d mots). Maximum : %d mots.

source: Word count is good (%d words).
fr_fr: Le nombre de mots est bon (%d mots).

source: Featured Image
fr_fr: Image à la une

source: Featured image should be at least %dx%d pixels, under %dKB, with alt text under %d characters.
fr_fr: L'image à la une doit faire au moins %dx%d pixels, peser moins de %dKB, avec un texte alternatif de moins de %d caractères.

source: No featured image set.
fr_fr: Aucune image à la une définie.

source: Image dimensions (%dx%d) are too small. Minimum: %dx%d pixels.
fr_fr: Les dimensions de l'image (%dx%d) sont trop petites. Minimum : %dx%d pixels.

source: Image file size (%dKB) is too large. Maximum: %dKB for fast loading.
fr_fr: La taille du fichier image (%dKB) est trop grande. Maximum : %dKB pour un chargement rapide.

source: Featured image is missing alt text. Alt text is required for accessibility and SEO.
fr_fr: L'image à la une n'a pas de texte alternatif. Le texte alternatif est requis pour l'accessibilité et le SEO.

source: Alt text is too long (%d characters). Maximum recommended: %d characters.
fr_fr: Le texte alternatif est trop long (%d caractères). Maximum recommandé : %d caractères.

source: Featured image meets all requirements (%s, %s).
fr_fr: L'image à la une répond à toutes les exigences (%s, %s).

source: Image quality issues detected:
fr_fr: Problèmes de qualité d'image détectés :

source: None
fr_fr: Aucun

source: Image appears blurry (sharpness: %.2f, minimum: %d)
fr_fr: L'image semble floue (netteté : %.2f, minimum : %d)

source: Image is too dark (brightness: %.2f, minimum: %d)
fr_fr: L'image est trop sombre (luminosité : %.2f, minimum : %d)

source: Image is too bright/overexposed (brightness: %.2f, maximum: %d)
fr_fr: L'image est trop claire/surexposée (luminosité : %.2f, maximum : %d)

source: Image has low contrast (contrast: %.2f, minimum: %d)
fr_fr: L'image a un faible contraste (contraste : %.2f, minimum : %d)

source: Image compression quality is low (quality: %d%%, recommended: %d%%+)
fr_fr: La qualité de compression de l'image est faible (qualité : %d%%, recommandé : %d%%+)

source: Meta Description
fr_fr: Méta-description

source: Meta description should be between %d and %d characters for optimal display in search results.
fr_fr: La méta-description doit contenir entre %d et %d caractères pour un affichage optimal dans les résultats de recherche.

source: No meta description set. Use Yoast SEO, Rank Math, or All in One SEO to add one.
fr_fr: Aucune méta-description définie. Utilisez Yoast SEO, Rank Math ou All in One SEO pour en ajouter une.

source: Meta description is too short (%d characters). Minimum: %d characters.
fr_fr: La méta-description est trop courte (%d caractères). Minimum : %d caractères.

source: Meta description is too long (%d characters). Maximum: %d characters.
fr_fr: La méta-description est trop longue (%d caractères). Maximum : %d caractères.

source: Meta description length is perfect (%d characters).
fr_fr: La longueur de la méta-description est parfaite (%d caractères).

source: Internal Links
fr_fr: Liens internes

source: Posts should have between %d and %d internal links for better SEO and user engagement.
fr_fr: Les articles doivent contenir entre %d et %d liens internes pour un meilleur SEO et engagement des utilisateurs.

source: No links found. Add at least %d internal links to related articles.
fr_fr: Aucun lien trouvé. Ajoutez au moins %d liens internes vers des articles connexes.

source: Too few internal links (%d found). Minimum recommended: %d links.
fr_fr: Trop peu de liens internes (%d trouvés). Minimum recommandé : %d liens.

source: Too many internal links (%d found). Maximum recommended: %d links.
fr_fr: Trop de liens internes (%d trouvés). Maximum recommandé : %d liens.

source: Good number of internal links (%d links).
fr_fr: Bon nombre de liens internes (%d liens).

source: Categories
fr_fr: Catégories

source: Posts should have between %d and %d categories for proper organization.
fr_fr: Les articles doivent avoir entre %d et %d catégories pour une bonne organisation.

source: No categories assigned. Assign at least %d category.
fr_fr: Aucune catégorie assignée. Assignez au moins %d catégorie.

source: Too few categories (%d assigned). Minimum: %d category.
fr_fr: Trop peu de catégories (%d assignées). Minimum : %d catégorie.

source: Too many categories (%d assigned). Maximum recommended: %d categories.
fr_fr: Trop de catégories (%d assignées). Maximum recommandé : %d catégories.

source: Good number of categories (%d assigned).
fr_fr: Bon nombre de catégories (%d assignées).

source: Tags
fr_fr: Étiquettes

source: Posts should have between %d and %d tags for better discoverability.
fr_fr: Les articles doivent avoir entre %d et %d étiquettes pour une meilleure découvrabilité.

source: Few tags (%d assigned). Recommended minimum: %d tags.
fr_fr: Peu d'étiquettes (%d assignées). Minimum recommandé : %d étiquettes.

source: Too many tags (%d assigned). Maximum recommended: %d tags.
fr_fr: Trop d'étiquettes (%d assignées). Maximum recommandé : %d étiquettes.

source: Good number of tags (%d assigned).
fr_fr: Bon nombre d'étiquettes (%d assignées).

source: Permalink
fr_fr: Permalien

source: Permalink should be under %d characters for better SEO.
fr_fr: Le permalien doit contenir moins de %d caractères pour un meilleur SEO.

source: Permalink is too long (%d characters). Maximum recommended: %d characters.
fr_fr: Le permalien est trop long (%d caractères). Maximum recommandé : %d caractères.

source: Permalink length is good (%d characters).
fr_fr: La longueur du permalien est bonne (%d caractères).

source: Subheadings (H2/H3)
fr_fr: Sous-titres (H2/H3)

source: Content should have at least %d subheadings (H2 or H3 tags) for better structure.
fr_fr: Le contenu doit avoir au moins %d sous-titres (balises H2 ou H3) pour une meilleure structure.

source: Not enough subheadings (%d found). Minimum: %d subheadings.
fr_fr: Pas assez de sous-titres (%d trouvés). Minimum : %d sous-titres.

source: Good use of subheadings (%d found).
fr_fr: Bon usage des sous-titres (%d trouvés).

source: SEO Plugin Score
fr_fr: Score du plugin SEO

source: No SEO plugin detected. Consider installing Yoast SEO or Rank Math.
fr_fr: Aucun plugin SEO détecté. Envisagez d'installer Yoast SEO ou Rank Math.

source: Yoast SEO score is low. Improve your content for better SEO.
fr_fr: Le score Yoast SEO est faible. Améliorez votre contenu pour un meilleur SEO.

source: Rank Math SEO score is low. Improve your content for better SEO.
fr_fr: Le score Rank Math SEO est faible. Améliorez votre contenu pour un meilleur SEO.

source: Good SEO score from %s.
fr_fr: Bon score SEO de %s.

source: Afrique Sports SEO Settings
fr_fr: Paramètres SEO Afrique Sports

source: SEO Checker
fr_fr: Vérificateur SEO

source: Settings saved successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Configure SEO requirements for your content. These settings ensure all articles meet Google News and SEO best practices for 2025.
fr_fr: Configurez les exigences SEO pour votre contenu. Ces paramètres garantissent que tous les articles respectent les meilleures pratiques Google News et SEO pour 2025.

source: Title Settings
fr_fr: Paramètres du titre

source: Configure title length requirements for SEO optimization.
fr_fr: Configurez les exigences de longueur de titre pour l'optimisation SEO.

source: Content Settings
fr_fr: Paramètres du contenu

source: Set content quality requirements including word count and heading structure.
fr_fr: Définissez les exigences de qualité du contenu incluant le nombre de mots et la structure des titres.

source: Featured Image Settings
fr_fr: Paramètres de l'image à la une

source: Featured image requirements for Google News and social sharing (recommended: 1200x628px, <200KB).
fr_fr: Exigences pour l'image à la une pour Google News et le partage social (recommandé : 1200x628px, <200KB).

source: Meta Description Settings
fr_fr: Paramètres de la méta-description

source: Meta description requirements. Integrates with Yoast SEO, Rank Math, and All in One SEO.
fr_fr: Exigences de méta-description. S'intègre avec Yoast SEO, Rank Math et All in One SEO.

source: Internal Links Settings
fr_fr: Paramètres des liens internes

source: Internal linking requirements for better SEO and user experience.
fr_fr: Exigences de liens internes pour un meilleur SEO et une meilleure expérience utilisateur.

source: Categories & Tags Settings
fr_fr: Paramètres des catégories et étiquettes

source: Category and tag requirements for content organization.
fr_fr: Exigences de catégories et d'étiquettes pour l'organisation du contenu.

source: General Settings
fr_fr: Paramètres généraux

source: General plugin settings and enforcement options.
fr_fr: Paramètres généraux du plugin et options d'application.

source: Minimum Characters
fr_fr: Caractères minimum

source: Maximum Characters
fr_fr: Caractères maximum

source: Required
fr_fr: Requis

source: Minimum Word Count
fr_fr: Nombre de mots minimum

source: Maximum Word Count
fr_fr: Nombre de mots maximum

source: Minimum Headings (H2/H3)
fr_fr: Sous-titres minimum (H2/H3)

source: Minimum Width (px)
fr_fr: Largeur minimum (px)

source: Minimum Height (px)
fr_fr: Hauteur minimum (px)

source: Maximum File Size (KB)
fr_fr: Taille de fichier maximum (KB)

source: Alt Text Required
fr_fr: Texte alternatif requis

source: Alt Text Max Characters
fr_fr: Caractères maximum du texte alternatif

source: Enable Quality Check
fr_fr: Activer la vérification de qualité

source: Check for blur, brightness, and contrast issues
fr_fr: Vérifier les problèmes de flou, luminosité et contraste

source: Minimum Internal Links
fr_fr: Liens internes minimum

source: Maximum Internal Links
fr_fr: Liens internes maximum

source: Category Required
fr_fr: Catégorie requise

source: Minimum Categories
fr_fr: Catégories minimum

source: Maximum Categories
fr_fr: Catégories maximum

source: Minimum Tags
fr_fr: Étiquettes minimum

source: Maximum Tags
fr_fr: Étiquettes maximum

source: Permalink Max Length
fr_fr: Longueur maximum du permalien

source: Post Types to Check
fr_fr: Types de contenu à vérifier

source: Block Publishing on Failure
fr_fr: Bloquer la publication en cas d'échec

source: SEO Best Practices 2025
fr_fr: Meilleures pratiques SEO 2025

source: Title:
fr_fr: Titre :

source: 45-60 characters optimal for Google search results
fr_fr: 45-60 caractères optimal pour les résultats de recherche Google

source: Featured Image:
fr_fr: Image à la une :

source: 1200x628px minimum for social sharing and Google News
fr_fr: 1200x628px minimum pour le partage social et Google News

source: Meta Description:
fr_fr: Méta-description :

source: 140-160 characters for best SERP display
fr_fr: 140-160 caractères pour un meilleur affichage dans les SERP

source: Word Count:
fr_fr: Nombre de mots :

source: 400-2000 words for news articles
fr_fr: 400-2000 mots pour les articles d'actualité

source: Internal Links:
fr_fr: Liens internes :

source: 2-5 links improve site structure and engagement
fr_fr: 2-5 liens améliorent la structure du site et l'engagement
